andrew867/dashcdg/platform/espidf/projects/dashcdg_badge/sdkconfig.defaults
# Freenove ESP32 CYD-class boards: ESP32 (not S2/S3/C3), 4 MB flash typical.
CONFIG_IDF_TARGET="esp32"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Dual OTA slots (A/B) on 4 MB flash — see partitions_ota_4mb.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_4mb.csv"

# Main task stack (app_main + launcher + optional debug auto-karaoke navigation — avoid overflow).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# UART console (115200 is ESP-IDF default)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# ESP-IDF 5.5 keeps FreeRTOS static allocation enabled internally.
# Keep early startup task stacks lean to avoid scheduler-start alloc asserts.
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1024
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=1536
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
# Lab PCM uses esp_timer ISR dispatch when available (accurate sample clock vs ESP_TIMER_TASK).
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y
# sys_evt runs Wi‑Fi + esp_netif handlers; 1536 overflowed (IDF 5.5). DRAM headroom comes from
# CONFIG_DASHCDG_BADGE_RX_CDG_ON_HEAP, not from shrinking this stack.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048

# XPT2046: keep raw ADC; map with Freenove cal bounds in display_lvgl.c (see board_cyd_freenove_32.h)
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=n
# PENIRQ low-power path (GPIO36 + ~10k pull-up on CYD); display_lvgl.c forces LV_INDEV_MODE_TIMER after add_touch.
CONFIG_XPT2046_INTERRUPT_MODE=y

# --- Internal DRAM headroom ---
# CDG + batch jitter on heap while RX runs (dashcdg_badge_rx_stop frees): shrinks .dram0.bss so the
# link fits dram0_0_seg on ESP32-WROOM (no PSRAM). Static .bss mode was ~272 B over limit with lean stacks.
CONFIG_DASHCDG_BADGE_RX_CDG_ON_HEAP=y
# CDG SPI: inline blit from LVGL tick (proven). Deferred worker + second-task `lvgl_port_lock` caused
# persistent black CDG / starvation; keep off unless re-validating end-to-end on hardware.
# CONFIG_DASHCDG_BADGE_CDG_DEFERRED_BLIT is not set
# 0 = wait until DMA accepts full chunk (no truncated `dac_continuous_write` bursty chop).
CONFIG_DASHCDG_BADGE_DAC_WRITE_TIMEOUT_MS=0
# Opus: mono decoder only (~smaller heap blob than stereo); TX should send mono for badge.
CONFIG_DASHCDG_BADGE_OPUS_MONO_ONLY=y
# Strip v4 repair NACK uplink (saves code/RAM; enable in menuconfig if needed).
CONFIG_DASHCDG_BADGE_ENABLE_REPAIR_NACK=n
# IPv4-only badge path (multicast / STA); frees lwIP IPv6 pools.
CONFIG_LWIP_IPV6=n

# Wi-Fi RX/TX pools (defaults ~10 static RX + 32/32 dynamic on ESP32).
# With AMPDU enabled, Espressif recommends keeping static RX buffers at least 6 (below 6 only if
# AMPDU is off). See ESP-IDF Wi-Fi buffer / QoS docs.
#
# History: the post-qcelp regression hypothesis ("bump RX pools to absorb bursty AMPDU mcast") was
# tested at 10/24/16 and observed to *worsen* internal-DRAM pressure: under decode load `heap_i`
# now dipped to 512 bytes (largest contiguous 16 bytes) and lwIP `select` returned ENOMEM closing
# the unicast-dup socket — without measurably reducing `d_amiss` (still 20–46/s).  Mcast frames do
# not aggregate / block-ACK anyway, so AMPDU RX_BA_WIN sizing is not the bottleneck for the
# multicast karaoke wire; the wire loss appears to be the AP buffering mcast at DTIM cadence
# rather than driver-side overflow.  Restore the pre-regression pool size and recover ~26 KB of
# DRAM for lwIP / audio jitter / Opus workspace.  If a future capture shows `wifi: br=12, 0`
# driver drops, raise STATIC_RX first (cheaper than dynamic).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
# AMPDU (802.11n block ack): better airtime efficiency on many APs; uses a bit more Wi-Fi driver RAM for
# reorder/BA state. Disabled previously for internal-RAM headroom; re-enabled to help RX bursty UDP
# (multicast karaoke). If Opus init fails more often, try n/n again or lower DYNAMIC_*_BUFFER_NUM slightly.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# Do not restore a previous lwIP DHCP lease after reboot (cleaner when switching APs / lab networks).
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=n

# lwIP: badge opens mcast x3 + ucast x3 + uplink (+ mDNS) — 6 was too few; extra UDP PCBs fail silently.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_MAX_ACTIVE_TCP=4
CONFIG_LWIP_MAX_LISTENING_TCP=4
CONFIG_LWIP_MAX_UDP_PCBS=12
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
# Honor badge_rx setsockopt(SO_RCVBUF) — without this, requests are ignored and bursty mcast/ucast audio drops.
CONFIG_LWIP_SO_RCVBUF=y
# Per-UDP-PCB mailbox depth (datagrams queued before tcpip thread reads). Default 6 loses bursts under Wi‑Fi.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# RX `select` cadence (badge_rx; perf spec §3.8 / tranche T8).
CONFIG_DASHCDG_BADGE_RX_SELECT_TIMEOUT_MS=12
CONFIG_DASHCDG_BADGE_RX_SELECT_TIMEOUT_AUDIO_ONLY_MS=4

# LVGL (esp_lvgl_port): do not compile bundled examples/ demos — badge ships its own UI only; faster full builds.
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set

# Unity: badge firmware does not use on-device IDF test runner — slightly smaller/faster builds.
# CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER is not set

# No Ethernet PHY on badge — Wi‑Fi STA only.
# CONFIG_ETH_ENABLED is not set

# OpenOCD GDB stub not needed in normal badge builds (re-enable for chip debug).
# CONFIG_ESP_GDBSTUB_ENABLED is not set

# STA-only Wi‑Fi (no SoftAP / WPA‑Enterprise).
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set

# No HTTPS/TLS to arbitrary hosts — badge uses UDP/multicast + custom protocol only.
# Re-enable bundle (or embed a custom CA) before adding esp_http_client / esp_https_ota / MQTT TLS.
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set

# Auto-open Karaoke once after STA DHCP (lab/agent soak); decode toggles still come from NVS / settings UI.
CONFIG_DASHCDG_BADGE_DEBUG_AUTO_LAUNCH_KARAOKE_AFTER_DHCP=y

# Prefer speed over -Og when not actively GDB-stepping (Cursor agents often leave DEBUG optimization on).
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_OPTIMIZATION_LEVEL_RELEASE=y
CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE=y
